[
    {
        "id": 1,
        "image": "https://i.ibb.co/VgGqLw8/food-donation1.jpg",
        "title": "Meals for Children in Need",
        "category": "Food",
        "category_bg": "#0000ff33",
        "card_bg": "#0000ff1a",
        "text_button_bg": "#0000ffe6",
        "description": "Your generous donation ensures that elderly individuals who can't afford nutritious meals receive the comfort and sustenance they need. By providing essential nourishment, you improve their health and well-being, bringing hope and relief to vulnerable seniors in need.",
        "price": 150
    },
    {
        "id": 2,
        "image": "https://i.ibb.co/CV1ZsQ4/clothing-donation1.jpg",
        "title": "Warm Winter Clothes for the Homeless",
        "category": "Clothing",
        "category_bg": "#ffa50033",
        "card_bg": "#ffa5001a",
        "text_button_bg": "#ffa500e6",
        "description": "Help protect homeless individuals from the harsh cold of winter by donating warm clothing. Your contribution offers comfort and dignity to those living on the streets, providing essential warmth and protection against the elements. Join us in making a positive impact.",
        "price": 250
    },
    {
        "id": 3,
        "image": "https://i.ibb.co/BsSQQgL/health-donation1.jpg",
        "title": "Support Cancer Patients",
        "category": "Health",
        "category_bg": "#ff000033",
        "card_bg": "#ff00001a",
        "text_button_bg": "#ff0000e6",
        "description": "Offer essential financial assistance and compassionate care to individuals courageously battling cancer. Your donation provides relief and hope, easing the financial burden and supporting them in their fight against this devastating disease. Join us in making a meaningful impact.",
        "price": 450
    },
    {
        "id": 4,
        "image": "https://i.ibb.co/72qQh58/education-donation2.jpg",
        "title": "Books for Underprivileged Schools",
        "category": "Education",
        "category_bg": "#00ff0033",
        "card_bg": "#00ff001a",
        "text_button_bg": "#006400",
        "description": "Promote education in low-income areas by donating books and educational materials to underprivileged schools. Your support enriches the learning experience for children in under-served communities, empowering them with knowledge and opportunities for a brighter future.",
        "price": 250
    },
    {
        "id": 5,
        "image": "https://i.ibb.co/XD3y5Cy/health-donation2.jpg",
        "title": "Support Medical Research",
        "category": "Health",
        "category_bg": "#ff000033",
        "card_bg": "#ff00001a",
        "text_button_bg": "#ff0000e6",
        "description": "Your generous donation helps fund critical medical research projects aimed at improving healthcare worldwide. By supporting this cause, you contribute to groundbreaking discoveries and innovative treatments for a wide range of diseases and conditions. Together, we can make a significant and lasting impact on the health and well-being of individuals and communities across the globe.",
        "price": 500
    },
    {
        "id": 6,
        "image": "https://i.ibb.co/b15gsjb/education-donation3.jpg",
        "title": "Scholarship for underprivileged Students",
        "category": "Education",
        "category_bg": "#00ff0033",
        "card_bg": "#00ff001a",
        "text_button_bg": "#006400",
        "description": "Empower underprivileged children with the gift of education. Your support ensures that deserving students, regardless of their economic circumstances, have access to quality education. By breaking the cycle of poverty, we pave the way for a brighter future for these young minds.",
        "price": 300
    },
    {
        "id": 7,
        "image": "https://i.ibb.co/h7Y1D0R/food-donation2.jpg",
        "title": "Emergency Food Aid",
        "category": "Food",
        "category_bg": "#0000ff33",
        "card_bg": "#0000ff1a",
        "text_button_bg": "#0000ffe6",
        "description": "In times of crisis and disaster, your donation provides immediate relief by helping feed hungry families. By ensuring access to nutritious meals, we provide not only sustenance but also hope during challenging circumstances. Join us in making a difference in their lives.",
        "price": 200
    },
    {
        "id": 8,
        "image": "https://i.ibb.co/YdyG8Vg/clothing-donation2.jpg",
        "title": "Warm Blankets for the Homeless",
        "category": "Clothing",
        "category_bg": "#ffa50033",
        "card_bg": "#ffa5001a",
        "text_button_bg": "#ffa500e6",
        "description": "During the winter months, your support makes a difference by distributing warm blankets to homeless individuals. Your generous contribution provides comfort and protection from the cold, helping those in need survive the harsh winter and offering a glimmer of warmth and hope.",
        "price": 200
    },
    {
        "id": 9,
        "image": "https://i.ibb.co/KFkCBsJ/food-donation3.jpg",
        "title": "Clean Water for Communities",
        "category": "Food",
        "category_bg": "#0000ff33",
        "card_bg": "#0000ff1a",
        "text_button_bg": "#0000ffe6",
        "description": "Ensure access to clean and safe drinking water for communities in need. Your donation makes a significant impact on improving health and well-being in disadvantaged areas, providing a basic necessity that enhances the quality of life for those we serve.",
        "price": 350
    },
    {
        "id": 10,
        "image": "https://i.ibb.co/yg70qDY/clothing-donation3.jpg",
        "title": "Donate Clothing to Orphanages",
        "category": "Clothing",
        "category_bg": "#ffa50033",
        "card_bg": "#ffa5001a",
        "text_button_bg": "#ffa500e6",
        "description": "Make a difference in the lives of children living in orphanages and foster care by providing them with clothing. Your contribution brings warmth and happiness, ensuring that these young individuals have comfortable clothing to wear and feel a sense of care and support.",
        "price": 300
    },
    {
        "id": 11,
        "image": "https://i.ibb.co/Xj39CF8/education-donation1.jpg",
        "title": "Build Schools in Developing Countries",
        "category": "Education",
        "category_bg": "#00ff0033",
        "card_bg": "#00ff001a",
        "text_button_bg": "#006400",
        "description": "Support the construction of schools and the provision of quality education in remote areas of developing countries. Your contribution bridges the educational gap, offering children in under-served communities the opportunity to learn, grow, and create a brighter future for themselves and their communities.",
        "price": 400
    },
    {
        "id": 12,
        "image": "https://i.ibb.co/tDZDKpz/health-donation3.jpg",
        "title": "Support Mental Health Awareness",
        "category": "Health",
        "category_bg": "#ff000033",
        "card_bg": "#ff00001a",
        "text_button_bg": "#ff0000e6",
        "description": "Your contribution helps raise awareness and provides crucial resources for mental health issues. By supporting this cause, you enable programs that reduce stigma, increase access to care, and improve the overall well-being of individuals living with mental health conditions. Join us in promoting mental health and well-being.",
        "price": 350
    }
]
